Documents/ПутевойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПутевойЛист</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасходаТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеСпидометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСписанияПоГСМВАО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутОткуда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутКуда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КилометражМаршрута</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеЧеки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЧека</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГСМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЧекаПоГСМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПутевойЛист/Ext/ManagerModule.bsl
Функция ПечатьПутевогоЛиста(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛистПоказания.Ссылка,
		|	ПутевойЛистПоказания.НомерСтроки,
		|	ПутевойЛистПоказания.Дата,
		|	ПутевойЛистПоказания.Начало,
		|	ПутевойЛистПоказания.Конец,
		|	ПутевойЛистПоказания.МаршрутОткуда,
		|	ПутевойЛистПоказания.МаршрутКуда,
		|	ПутевойЛистПоказания.КилометражМаршрута,
		|	ПутевойЛистПоказания.Ссылка.Номер КАК НомерДокумента,
		|	ПутевойЛистПоказания.Ссылка.ТранспортноеСредство.МаркаАвтомобиля КАК МаркаАвтомобиля,
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК Водитель,
		|	ПутевойЛистПоказания.Ссылка.ТранспортноеСредство.ГосударственныйРегистрационныйНомер КАК ГосНомер,
		|	ПутевойЛистПоказания.Ссылка.НормаРасходаТоплива КАК НормаСписания,
		|	ПутевойЛистПоказания.Ссылка.ПоказаниеСпидометра
		|ИЗ
		|	Документ.ПутевойЛист.Показания КАК ПутевойЛистПоказания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКон, ) КАК ФИОФизЛицСрезПоследних
		|		ПО ПутевойЛистПоказания.Ссылка.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	ПутевойЛистПоказания.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка",  Ссылка);
    Запрос.УстановитьПараметр("ДатаКон", Ссылка.Дата);
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ПутевойЛистПоказания.Дата) КАК ДатаНачало,
		|	МАКСИМУМ(ПутевойЛистПоказания.Дата) КАК ДатаКонец
		|ИЗ
		|	Документ.ПутевойЛист.Показания КАК ПутевойЛистПоказания
		|ГДЕ
		|	ПутевойЛистПоказания.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписиДаты = Результат.Выбрать();
	ВыборкаДетальныеЗаписиДаты.Следующий(); 

	
	
	ТабДокумент = Новый ТабличныйДокумент;

	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 5;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 5;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист";
	
	Макет = Документы.ПутевойЛист.ПолучитьМакет("ПутевойЛист");
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");   
    ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
	ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписиДаты); 
	
	СведенияООрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаДетальныеЗаписи.Ссылка.Организация, ВыборкаДетальныеЗаписи.Ссылка.Дата); 
	ОбластьМакета.Параметры.Организация = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияООрганизации, "ПолноеНаименование, ФактическийАдрес, Телефоны"); 
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");	
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	ВыборкаДетальныеЗаписи.Сбросить(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 	
		ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
		ТабДокумент.Вывести(ОбластьМакетаСтрока);
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи.Сбросить();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
	ОбластьМакетаПодвал.Параметры.ИтогоПройдено = ВыборкаДетальныеЗаписи.Ссылка.Показания.Итог("КилометражМаршрута");
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции




Функция ПечатьОтчетПоЧекам(Ссылка) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;

	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 5;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 5;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист";
	
	Макет = Документы.ПутевойЛист.ПолучитьМакет("ОтчетПоЧекам");
	
	Если Ссылка.ПредоставленныеЧеки.Количество() Тогда
		
		ОбластьМакетаШапкаПредоставленныеЧеки = Макет.ПолучитьОбласть("ШапкаПредоставленныеЧеки");
		ТабДокумент.Вывести(ОбластьМакетаШапкаПредоставленныеЧеки);
		
		Для каждого ТекСтрока Из Ссылка.ПредоставленныеЧеки Цикл
			
			ОбластьМакетаШапкаСтрокаПредоставленныеЧеки = Макет.ПолучитьОбласть("СтрокаПредоставленныеЧеки");
			ОбластьМакетаШапкаСтрокаПредоставленныеЧеки.Параметры.Заполнить(ТекСтрока); 
			ТабДокумент.Вывести(ОбластьМакетаШапкаСтрокаПредоставленныеЧеки);
			
		КонецЦикла;
		
		СтруктураИтог = Новый Структура;
		
		СтруктураИтог.Вставить("КоличествоГСМ", Ссылка.ПредоставленныеЧеки.Итог("КоличествоГСМ"));
		СтруктураИтог.Вставить("СуммаЧекаПоГСМ", Ссылка.ПредоставленныеЧеки.Итог("СуммаЧекаПоГСМ"));
		
		ОбластьМакетаИтогоПредоставленныеЧеки = Макет.ПолучитьОбласть("ИтогоПредоставленныеЧеки");
		ОбластьМакетаИтогоПредоставленныеЧеки.Параметры.Заполнить(СтруктураИтог); 
		ТабДокумент.Вывести(ОбластьМакетаИтогоПредоставленныеЧеки);
	
	КонецЕсли;
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
	ОбластьМакетаПодвал.Параметры.НормаСписания		    = Ссылка.НормаРасходаТоплива;
	ОбластьМакетаПодвал.Параметры.СуммаСписанияПоГСМВАО = Ссылка.СуммаСписанияПоГСМВАО;

	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции
